УТ_для_edt.РасширениеСмарт/src/Documents/ВзаимозачетЗадолженности/ВзаимозачетЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e607e7b9-ef7c-448d-84b9-25ad0192be1d">
  <name>ВзаимозачетЗадолженности</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e5c4c09c-88a2-4187-a375-2311ac0e20a3">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="b7e08104-e8f0-4b81-bf7f-86642070b6b2">
    <name>ДебиторскаяЗадолженность</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="fb4201e0-b30a-4290-910f-e0149efe4163">
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>СуммаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/ВзаимозачетЗадолженности/ObjectModule.bsl
#Область ПеренесеноСДоработкамиСмарт
&После("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведенияПосле(Отказ, РежимПроведения)
   //++ #1116 смарт: Фролов 17.01.2023 //Авторезервирование оплаченных заказов перевод в статус Резервирование на складе.  
   Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение 
        И НЕ ОбменДанными.Загрузка 
        И НЕ Отказ Тогда 
        
        Если Справочники.смартПредопределенныеЗначения.ПроцентОплатыЗаказаДляИерархииПоОплате.Значение=Неопределено Тогда
            ПределПроцента = 0;
        Иначе
            ПределПроцента = Справочники.смартПредопределенныеЗначения.ПроцентОплатыЗаказаДляИерархииПоОплате.Значение;
        КонецЕсли; 
        
        Если ДебиторскаяЗадолженность.Количество()>0 Тогда
            Для каждого Стр Из ДебиторскаяЗадолженность Цикл
                //Добавляем запись в регистр смартОплатыПоЗаказам по Заказам клиента(ЗК) в Документах Поступления БДС.
                //ЗК - не в статусе Закрыт, не помечен на Удаление, Проведен
                Отбор = Новый Структура;
                Отбор.Вставить("Заказ", Стр.Заказ);
                ПроцентОплаты = 0;
                ВыборкаРег = РегистрыСведений.СостоянияЗаказовКлиентов.Выбрать(Отбор);
                
                Если ВыборкаРег.Следующий() Тогда
                    ПроцентОплаты = ВыборкаРег.ПроцентОплаты;
                КонецЕсли;
                
                Если ТипЗнч(Стр.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") 
                    И Стр.Заказ.Проведен И НЕ Стр.Заказ.ПометкаУдаления 
                    И НЕ Стр.Заказ.Статус = Перечисления.СостоянияЗаказовКлиентов.Закрыт 
                    И ПроцентОплаты >= ПределПроцента Тогда
                    НаборЗаписей = РегистрыСведений.смартОплатыПоЗаказам.СоздатьНаборЗаписей(); 
                    НаборЗаписей.Отбор.ЗаказКлиента.Установить(Стр.Заказ); 
                    НоваяЗапись = НаборЗаписей.Добавить(); 
                    НоваяЗапись.ЗаказКлиента = Стр.Заказ; 
                    НоваяЗапись.ПоступлениеБДС = Ссылка; 
                    НаборЗаписей.Записать(); 
				КонецЕсли;
				//++ #1349 смарт: Фролов 03.05.2023 //Добавить оповещение при оплате 30% при поступлении оплаты. Продолжение задачи 1134
				Если ТипЗнч(Стр.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") 
                    И Стр.Заказ.Проведен И НЕ Стр.Заказ.ПометкаУдаления 
                    И НЕ Стр.Заказ.Статус = Перечисления.СостоянияЗаказовКлиентов.Закрыт Тогда
					смартСервер.ОтправитьПисьмоПоОплатеЗаказа(Стр.Заказ);
				Конецесли;	
				//-- #1349 смарт: Фролов 03.05.2023
                
            КонецЦикла;
        КонецЕсли;
    КонецЕсли;  
//-- #1116 смарт: Фролов 17.01.2023
КонецПроцедуры
#КонецОбласти
